## Importing the libraries and dataset

In [4]:
import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plp
import seaborn as sns
import scipy

In [6]:
path = r'C:\Users\BaratSakhizada\Desktop\Achievement 4\02 Data\Original'

In [14]:
df_cust = pd.read_csv(os.path.join(path, 'customers.csv'), index_col = False)

In [18]:
# checking the dataframe's columns 
df_cust.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## Wrangling the data

Wrangle the data so that it follows consistent logic; for example, rename columns with illogical names and drop columns that donâ€™t add anything to your analysis.

column's names are not written consistent. To arrange the dataframe better, I will change First Name to first_name, Surnm to last_name, Gender to gender, State to state, and Age to age. All the columns seem to have relevant data, but for the sake of practice, I will remove date_joined column.

In [34]:
df_cust.shape

(206209, 10)

In [58]:
# removing date_joined column, but not overwriting onto thte dataset.
df_cust.drop(columns = ['date_joined'])

,user_id,First Name,Surnam,Gender,STATE,Age,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1,married,40374
...,...,...,...,...,...,...,...,...,...
206204,168073,Lisa,Case,Female,North Carolina,44,1,married,148828
206205,49635,Jeremy,Robbins,Male,Hawaii,62,3,married,168639
206206,135902,Doris,Richmond,Female,Missouri,66,2,married,53374
206207,81095,Rose,Rollins,Female,California,27,1,married,99799
206208,80148,Cynthia,Noble,Female,New York,55,1,married,57095

I'd rather decided to only visually remove the date_joined column. Further in the analysis, even this column can provide effective info about the customers. By applying df_cust = df_cust.drop(columns = ['date_joined']) we could remove this column entirely from the dataframe.

### Renaming columns

In [63]:
df_cust.rename(columns = {'First Name': 'first_name'}, inplace = True)

In [67]:
df_cust.rename(columns={'Surnam' : 'last_name'}, inplace = True)

In [69]:
df_cust.rename(columns = {'Gender' : 'gender'}, inplace = True)

In [71]:
df_cust.rename(columns = {'STATE' : 'state'}, inplace = True)

In [75]:
df_cust.rename(columns = {'Age': 'age'}, inplace = True)

In [77]:
df_cust.rename(columns = {'n_dependants' : 'no_dependants'}, inplace = True)

In [81]:
# checking the changes in the columns 
df_cust.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'no_dependants', 'fam_status', 'income'],
      dtype='object')

In [83]:
# checking the changes in the columns
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

## Data Quality and Consistency Checks

Complete the fundamental data quality and consistency checks youâ€™ve learned throughout this Achievement; for example, check for and address missing values and duplicates, and convert any mixed-type data.

In [89]:
# checking column's data type
df_cust.dtypes

user_id           int64
first_name       object
last_name        object
gender           object
state            object
age               int64
date_joined      object
no_dependants     int64
fam_status       object
income            int64
dtype: object

### changing data types of few columns

In [98]:
# Optimizing the data types for certain columns
df_cust['first_name'] = df_cust['first_name'].astype('str')
df_cust['last_name'] = df_cust['last_name'].astype('str')
df_cust['gender'] = df_cust['gender'].astype('category')
df_cust['state'] = df_cust['state'].astype('category')
df_cust['fam_status'] = df_cust['fam_status'].astype('category')

In [173]:
# Converting date_joined to datetime and changing int type for some of the categories for memory efficiency
df_cust['date_joined'] = pd.to_datetime(df_cust['date_joined'])
df_cust['age'] = df_cust['age'].astype('int8')
df_cust['no_dependants'] = df_cust['no_dependants'].astype('int8')

In [175]:
# checking the changes in data type
df_cust.dtypes

user_id                   int64
first_name               object
last_name                object
gender                 category
state                  category
age                        int8
date_joined      datetime64[ns]
no_dependants              int8
fam_status             category
income                    int64
dtype: object

For memory optimization purposes, I also changed no_dependants to int8 and age to int32

### Checking for duplicates

In [118]:
# checking for duplicates in the dataframe
df_dups = df_cust[df_cust.duplicated()]

In [114]:
df_dups

Empty DataFrame
Columns: [user_id, first_name, last_name, gender, state, age, date_joined, no_dependants, fam_status, income]
Index: []

In [116]:
df_dups.shape

(0, 10)

The function indicates that there are no full duplicate rows in the dataframe

### Checking for missing values

In [122]:
# checking for missing values
df_cust.isnull().sum()

user_id          0
first_name       0
last_name        0
gender           0
state            0
age              0
date_joined      0
no_dependants    0
fam_status       0
income           0
dtype: int64

as seen above, there is no missing value in the dataframe. We could fill in the missing values with df['column with missings'].fillna(mean value, inplace=True) if we had found any.

## Combining Customer Data with the already Merged Data

### importing the ords_prods_merged dataframe

In [142]:
path2= r'C:\Users\BaratSakhizada\Desktop\Achievement 4\02 Data\Prepared Data'

In [144]:
df_ords_prods_merge = pd.read_pickle(os.path.join(path2, '4.8 ords_prods_merge.pickle'))

In [146]:
# checking the first 5 rows of the dataframe
df_ords_prods_merge.head()

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order,product_id,add_to_cart_order,reordered,...,merge2,busiest_day,busiest_days,busiest_hours,max_order,loyalty_flag,average_price,loyalty_flag2,median_prior_order,loyalty_flag3
0,2539329,1,prior,1,2,8,NaN,196,1,0,...,both,Regularly busy,regularly_busy_days,Average orders,10,New customer,6.367797,Lower Spender,20.5,Non-frequent customer
1,2539329,1,prior,1,2,8,NaN,14084,2,0,...,both,Regularly busy,regularly_busy_days,Average orders,10,New customer,6.367797,Lower Spender,20.5,Non-frequent customer
2,2539329,1,prior,1,2,8,NaN,12427,3,0,...,both,Regularly busy,regularly_busy_days,Average orders,10,New customer,6.367797,Lower Spender,20.5,Non-frequent customer
3,2539329,1,prior,1,2,8,NaN,26088,4,0,...,both,Regularly busy,regularly_busy_days,Average orders,10,New customer,6.367797,Lower Spender,20.5,Non-frequent customer
4,2539329,1,prior,1,2,8,NaN,26405,5,0,...,both,Regularly busy,regularly_busy_days,Average orders,10,New customer,6.367797,Lower Spender,20.5,Non-frequent customer

In [152]:
# checking shape of the dataframe
df_ords_prods_merge.shape

(32408279, 38)

In [149]:
# checking the first 5 rows of the dataframe to match the columns
df_cust.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,2017-01-01,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,2017-01-01,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,2017-01-01,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,2017-01-01,1,married,40374

user_id is the common column between both dataframes so it will be used as a key for joining bott.

In [154]:
# checking shape of the dataframe
df_cust.shape

(206209, 10)

In [187]:
# merging both dataframes together 
df_merged_all = df_cust.merge(df_ords_prods_merge, on = 'user_id', indicator = 'merge_cust')

In [188]:
df_merged_all.head()

,user_id,first_name,last_name,gender,state,age,date_joined,no_dependants,fam_status,income,...,busiest_day,busiest_days,busiest_hours,max_order,loyalty_flag,average_price,loyalty_flag2,median_prior_order,loyalty_flag3,merge_cust
0,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665,...,Regularly busy,regularly_busy_days,Most orders,8,New customer,7.988889,Lower Spender,19.0,Regular customer,both
1,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665,...,Regularly busy,regularly_busy_days,Most orders,8,New customer,7.988889,Lower Spender,19.0,Regular customer,both
2,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665,...,Regularly busy,slowest_days,Most orders,8,New customer,7.988889,Lower Spender,19.0,Regular customer,both
3,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665,...,Regularly busy,slowest_days,Most orders,8,New customer,7.988889,Lower Spender,19.0,Regular customer,both
4,26711,Deborah,Esquivel,Female,Missouri,48,2017-01-01,3,married,165665,...,Regularly busy,slowest_days,Most orders,8,New customer,7.988889,Lower Spender,19.0,Regular customer,both

In [191]:
# checking if the columns are merged or not
df_merged_all.columns

Index(['user_id', 'first_name', 'last_name', 'gender', 'state', 'age',
       'date_joined', 'no_dependants', 'fam_status', 'income', 'order_id',
       'eval_set', 'order_number', 'order_dow', 'order_hour_of_day',
       'days_since_prior_order', 'product_id', 'add_to_cart_order',
       'reordered', '_merge', 'Unnamed: 0_x', 'product_name_x', 'aisle_id_x',
       'department_id_x', 'prices_x', 'merge_indicator', 'Unnamed: 0_y',
       'product_name_y', 'aisle_id_y', 'department_id_y', 'prices_y',
       'merge1_indicator', 'Unnamed: 0', 'product_name', 'aisle_id',
       'department_id', 'prices', 'merge2', 'busiest_day', 'busiest_days',
       'busiest_hours', 'max_order', 'loyalty_flag', 'average_price',
       'loyalty_flag2', 'median_prior_order', 'loyalty_flag3', 'merge_cust'],
      dtype='object')

Both dataframes are joined into a single dataframe using user_id as the key

In [199]:
# checking shape of the combined dataframe
df_merged_all.shape

(32408279, 48)

## Exporting the Dataframe

In [195]:
path3 = r'C:\Users\BaratSakhizada\Desktop\Achievement 4\02 Data\Prepared Data'

In [201]:
df_merged_all.to_pickle(os.path.join(path3, 'Ex 4.9 cust_ords_prods_all_combined.pickle'))